# 1) У вас есть переменная my_str, тип - str. И переменная my_symbol, тип - str.
# Напечатать ЧИСЛО сколько раз my_symbol встречается в my_str.
# Пример:  my_str="blablacar", my_symbol="bla".
# Вывод на экран:
# 2

# my_str = "blablacar"
# my_symbol ="bla"
#
# result = my_str.count(my_symbol)
# print(result)



#
# 2) У вас есть переменная my_str, тип - str. И переменная my_symbol, тип - str.
# Напечатать столько раз my_symbol, сколько он встречается в my_str.
# Пример:  my_str="blablacar", my_symbol="bla".
# Вывод на экран:
# bla
# bla



# 3) У вас есть переменная my_str, тип - str. Напечатать ЧИСЛО сколько
# РАЗНЫХ символов встречается в my_str.
# Большая и маленькая буква считается как один символ.
# Пробелы, запятые и т.д. считаем тоже как символы.
# Пример:  my_str="bla BLA car".
# Вывод на экран:
# 6
#
# 4) Дана строка my_str и пустой список my_list.
# Заполнить my_list символами из my_str,
# которые стоят на четных местах в строке (считаем с 0)
#
# 5) Дана строка my_str, список str_index целых чисел в диапазоне от
# 0 до длинны строки минус 1, пустой список my_list.
# Заполнить my_list символами из my_str, которые стоят на местах с
# индексами из str_index
#
# 6) Дано целое число (int). Определить сколько цифр в этом числе.
#
# 7) Дано целое число. Определить наибольшую цифру в этом числе.
#
# 8) Дано целое число. Составить число (int) с цифрами в обратном порядке.
#
# 9) Дано целое число. Составить число с цифрами в порядке возрастания(убывания).
#
# 10) Даны списки my_list_1 и my_list_2.
# Создать список my_result в который поместить элементы из my_list_1 и
# my_list_2 через один, начиная с my_list_1.
# a) кол-во эл-тов одинаковое
# б) кол-во эл-тов разное
