# 1) У вас есть список my_list с значениями типа int.
# Распечатать те значения, которые больше 100.
# Задание выполнить с помощью цикла for.
#

# my_list = [230, 42, 24, 2, 9, 101, 124, 6, 0, 301, 100]
# for simbols in my_list:
#     if simbols > 100:
#         print(simbols)

# 2) У вас есть список my_list с значениями типа int, и пустой список my_results.
# Добавить в my_results те значения, которые больше 100.
# Распечатать список my_results.
# Задание выполнить с помощью цикла for.
#

# my_results = []
# for simbols in my_list:
#     if simbols > 100:
#         my_results.append(simbols)
# print(my_results)

# my_list = [230, 42, 24, 2, 9, 101, 124, 6, 0, 301, 100]
# 3) У вас есть список my_list с значениями типа int.
# Если в my_list количество элементов меньше 2, то в конец добавить значение 0.
# Если количество элементов больше или равно 2, то добавить сумму последних двух элементов.
# Количество элементов в списке можно получить с помощью функции len(my_list)


# my_list = [25,25]
# if len(my_list) < 2:
#     my_list.append(0)
#     print(my_list)
# elif len(my_list) >= 2:
#     my_list.append(my_list[-1] + my_list[-2])
#     print(my_list)
